# -*- coding: utf-8 -*-
# Author : zhaoguangpu@bytedance.com
# Created: 2022/12/06


joint_nlu = {
    "slot_categories": [
        '意向颜色', '用户称呼', '购车时间', '购车目的', '购车地点', '意向车型', '意向大类', '二手车车况_车型', '购车预算', '意向品牌', '配件/改装意向',
        '意向车系', '二手车车况_车龄', '微信', '个人征信', '电话', '二手车车况_里程', '性别', '二手车车况_其他', '联系途径', '付款方式'
    ],
    "ind_intent_categories": [
        '问微信', '问门店地址', '问具体车系库存', '求介绍', '问车价_落地价/裸车价', '咨询购车意见', '问改装', '问是否有现车', '问征信', '请求二手车估价',
        '问分期贷款', '商务合作/营销推广', '问提车方式', '咨询配置_其他', '问车况_里程', '问加装', '微信电话不同号', '问售后', '问电话', '问置换补贴',
        '咨询配置_车型', '要求客服打电话', '拒绝某种联系方式', '问购车优惠', '问车况_车龄', '问有哪些车系', '微信电话同号', '咨询配置_动力', '咨询配置_颜色',
        '要求客服加微信', '问汽车落户', '问所在城市经销商', '问二手车市价', '问门店/销售联系方式', '问车况_其他', '问维修'
    ],

    "slot_sample_ratio": {
        "电话": 1.0, "邮箱": 1.0, "微信": 1.0, "QQ": 1.0, "联系途径": 1.0, "用户称呼": 1.0, "性别": 1.0, "年龄": 1.0, "购车地点": 1.0,
        "个人征信": 1.0, "购车预算": 1.0, "购车时间": 1.0, "意向大类": 1.0, "意向品牌": 1.0, "意向车系": 1.0, "意向车型": 1.0, "意向颜色": 1.0,
        "购车目的": 1.0, "付款方式": 1.0, "车辆持有情况": 1.0, "试驾情况": 1.0, "是否接受跨地域提车": 1.0, "二手车车况_车龄": 1.0, "二手车车况_里程": 1.0,
        "二手车车况_事故记录": 1.0, "二手车车况_车型": 1.0, "二手车车况_其他": 1.0, "意向出手价": 1.0, "配件/改装意向": 1.0, "无": 0.6
    },
    "intent_sample_ratio": {
        "问电话": 1.0, "问微信": 1.0, "问门店/销售联系方式": 1.0, "问门店地址": 1.0, "微信电话同号": 1.0, "微信电话不同号": 1.0, "要求客服加微信": 1.0,
        "要求客服打电话": 1.0, "拒绝某种联系方式": 1.0,"求介绍": 1.0, "咨询购车意见": 1.0, "问所在城市经销商": 1.0, "问有哪些车系": 1.0, "问是否有现车": 1.0,
        "咨询配置_车型": 1.0, "咨询配置_动力": 1.0, "咨询配置_颜色": 1.0, "咨询配置_其他": 1.0,"咨询口碑_动力": 1.0, "咨询口碑_性价比": 1.0,
        "咨询口碑_舒适性": 1.0, "咨询口碑_操控": 1.0, "咨询口碑_空间": 1.0, "咨询口碑_内饰": 1.0, "咨询口碑_外观": 1.0, "咨询口碑_口碑": 1.0,"咨询口碑_其他": 1.0,
        "咨询用车成本_保险": 1.0, "咨询用车成本_保养": 1.0, "咨询用车成本_油耗": 1.0, "咨询用车成本_其他": 1.0, "问车价_落地价/裸车价": 1.0, "问汽车落户": 1.0,
        "问购车优惠": 1.0, "问分期贷款": 1.0, "问置换补贴": 1.0, "咨询预约试驾": 1.0, "请求二手车估价": 1.0, "问二手车市价": 1.0, "咨询二手车选购经验": 1.0,
        "问具体车系库存": 1.0, "问提车方式": 1.0,"问车况_车龄": 1.0, "问车况_里程": 1.0, "问车况_事故记录": 1.0, "问车况_其他": 1.0, "问改装": 1.0, "问维修": 1.0,
        "问加装": 1.0, "问汽车保养知识": 1.0, "问售后": 1.0, "问征信": 1.0, "商务合作/营销推广": 1.0, "无": 0.4
    }
}

ind_car_nlu = {
    "ind_intent_categories": [
        '问微信', '问门店地址', '问具体车系库存', '求介绍', '问车价_落地价/裸车价', '问是否有现车', '请求二手车估价', 
        '问分期贷款', '问提车方式', '问售后', '问电话', '问置换补贴', 
        '要求客服打电话', '拒绝某种联系方式', '问购车优惠', '问车况_车龄', '问有哪些车系', '微信电话同号', '咨询配置_颜色', 
        '要求客服加微信', '问汽车落户', '问所在城市经销商', '问门店/销售联系方式'
    ],
    "slot_categories": [
        '意向颜色', '用户称呼', '购车时间', '购车目的', '购车地点', '意向车型', '意向大类', '购车预算', '意向品牌', '配件/改装意向', 
        '意向车系', '二手车车况_车龄', '微信', '个人征信', '电话', '二手车车况_里程', '性别', '联系途径', '付款方式', "座位数", "变速箱类型", "能源类型"
    ],
    "slot_sample_ratio": {
        "电话": 1.0, "邮箱": 1.0, "微信": 1.0, "QQ": 1.0, "联系途径": 1.0, "用户称呼": 1.0, "性别": 1.0, "年龄": 1.0, "购车地点": 1.0,
        "个人征信": 1.0, "购车预算": 1.0, "购车时间": 1.0, "意向大类": 1.0, "意向品牌": 1.0, "意向车系": 1.0, "意向车型": 1.0, "意向颜色": 1.0,
        "购车目的": 1.0, "付款方式": 1.0, "车辆持有情况": 1.0, "试驾情况": 1.0, "是否接受跨地域提车": 1.0, "二手车车况_车龄": 1.0, "二手车车况_里程": 1.0,
        "二手车车况_事故记录": 1.0, "二手车车况_其他": 1.0, "意向出手价": 1.0, "配件/改装意向": 1.0, "无": 0.6, "座位数":1.0, 
        "变速箱类型": 1.0, "能源类型":1.0
    },
    "intent_sample_ratio": {
        "问电话": 1.0, "问微信": 1.0, "问门店/销售联系方式": 1.0, "问门店地址": 0.8, "微信电话同号": 1.0, "微信电话不同号": 1.0, "要求客服加微信": 1.0,
        "要求客服打电话": 1.0, "拒绝某种联系方式": 1.0,"求介绍": 0.6, "咨询购车意见": 1.0, "问所在城市经销商": 1.0, "问有哪些车系": 1.0, "问是否有现车": 1.0, 
        "咨询配置_车型": 1.0, "咨询配置_动力": 1.0, "咨询配置_颜色": 1.0, "咨询配置_其他": 1.0,"咨询口碑_动力": 1.0, "咨询口碑_性价比": 1.0, 
        "咨询口碑_舒适性": 1.0, "咨询口碑_操控": 1.0, "咨询口碑_空间": 1.0, "咨询口碑_内饰": 1.0, "咨询口碑_外观": 1.0, "咨询口碑_口碑": 1.0,"咨询口碑_其他": 1.0, 
        "咨询用车成本_保险": 1.0, "咨询用车成本_保养": 1.0, "咨询用车成本_油耗": 1.0, "咨询用车成本_其他": 1.0, "问车价_落地价/裸车价": 1.0, "问汽车落户": 1.0, 
        "问购车优惠": 1.0, "问分期贷款": 1.0, "问置换补贴": 1.0, "咨询预约试驾": 1.0, "请求二手车估价": 1.0, "问二手车市价": 1.0, "咨询二手车选购经验": 1.0,
        "问具体车系库存": 1.0, "问提车方式": 1.0,"问车况_车龄": 1.0, "问车况_里程": 1.0, "问车况_事故记录": 1.0, "问车况_其他": 1.0, "问改装": 1.0, "问维修": 1.0, 
        "问加装": 1.0, "问汽车保养知识": 1.0, "问售后": 1.0, "问征信": 1.0, "商务合作/营销推广": 1.0, "无": 0.2
    }
}

ind_car_slot = {
    "ind_intent_categories": [],
    "slot_categories": [
        '意向颜色', '用户称呼', '购车时间', '购车目的', '购车地点', '意向车型', '意向大类', '购车预算', '意向品牌', '配件/改装意向', 
        '意向车系', '二手车车况_车龄', '微信', '个人征信', '电话', '二手车车况_里程', '性别', '联系途径', '付款方式', "座位数", "变速箱类型", "能源类型"
    ],
    "slot_sample_ratio": {
        "电话": 1.0, "邮箱": 1.0, "微信": 1.0, "QQ": 1.0, "联系途径": 1.0, "用户称呼": 1.0, "性别": 1.0, "年龄": 1.0, "购车地点": 1.0,
        "个人征信": 1.0, "购车预算": 1.0, "购车时间": 1.0, "意向大类": 1.0, "意向品牌": 1.0, "意向车系": 1.0, "意向车型": 1.0, "意向颜色": 1.0,
        "购车目的": 1.0, "付款方式": 1.0, "车辆持有情况": 1.0, "试驾情况": 1.0, "是否接受跨地域提车": 1.0, "二手车车况_车龄": 1.0, "二手车车况_里程": 1.0,
        "二手车车况_事故记录": 1.0, "二手车车况_其他": 1.0, "意向出手价": 1.0, "配件/改装意向": 1.0, "无": 0.6, "座位数":1.0, 
        "变速箱类型": 1.0, "能源类型":1.0
    },
    "intent_sample_ratio": {}
}

comment_intention = {
     "ind_intent_categories": ["高意向", "非高意向"]
}


ind_car_v2_nlu = {
    "ind_intent_categories": ['其他', '问新车价格', '提供电话号', '给出地址', '询问有哪些车或指定车', '提供微信号', '问优惠', '问门店位置', '问首付', '要价格表', '问可否分期', '希望微信沟通', '买车', '请求被加微信', '问配置情况', '问月供', '要库存表', '以旧换新', '请求加对方微信', '微信电话同号', '请求图片', '问是否有门店', '询问联系方式', '问微信', '问电话', '怎样预约到店', '希望不要打电话', '问分期方案', '问分期利息', '问指定车收车价', '问分期期数', '请求联系', '问能否上指定地区牌照', '求推荐车', '问年款', '是否有现车', '问指定车的二手价', '问二手车车况', '已加过微信', '问分期全款', '给定时间到店', '表明指定时间不方便电话', '问以旧换新补贴优惠', '卖车', '希望电话沟通'],
    "slot_categories": ["其他"],
    "slot_sample_ratio": {},
    "intent_sample_ratio": {}
}

ind_car_intent = {
    "ind_intent_categories": ['其他', '问新车价格', '提供电话号', '给出地址', '询问有哪些车或指定车', '提供微信号', '问优惠', '问门店位置', '问首付', '要价格表', '问可否分期', '希望微信沟通', '买车', '请求被加微信', '问配置情况', '问月供', '要库存表', '以旧换新', '请求加对方微信', '微信电话同号', '请求图片', '问是否有门店', '询问联系方式', '问微信', '问电话', '怎样预约到店', '希望不要打电话', '问分期方案', '问分期利息', '问指定车收车价', '问分期期数', '请求联系', '问能否上指定地区牌照', '求推荐车', '问年款', '是否有现车', '问指定车的二手价', '问二手车车况', '已加过微信', '问分期全款', '给定时间到店', '表明指定时间不方便电话', '问以旧换新补贴优惠', '卖车', '希望电话沟通'],
    "slot_categories": ["其他"],
    "slot_sample_ratio": {},
    "intent_sample_ratio": {}
}

ind_home_nlu = {
    "ind_intent_categories": [
        '问电话', '问微信', '问机构联系方式', '微信电话同号', '要求对方加微信', '拒绝某种联系途径', '要求微信沟通',
        '要求客服打电话', '问回访时间', '要求对方联系', '智能性质疑', '问在线', '问机构名称', '问机构地点',
        '问机构可信度', '问费用', '问资料',
        '求介绍/咨询意见', '求加速', '问业务范围', '问产品/持续时长', '问是否能参观', '问装修材料', '问质量', '问尺寸',
        '问实践方法&专业知识', '无'
    ],
    "slot_categories": [
        '电话', '微信', '联系途径', '用户地点', '称呼', '回访时间', '上门/开工时间/装修时间', '具体需求', '房屋类型', '施工位置',
        '家具类型', '户型', '家具/装修风格', '材质材料', '房子or家具大小/面积/体积', '是否在线', '金额', '性别', '需求人员', '无'
    ],

    "slot_sample_ratio": {
        '电话': 1.0, '微信': 1.0, '联系途径': 1.0, '用户地点': 1.0, '称呼': 1.0, '回访时间': 1.0,
        '上门/开工时间/装修时间': 1.0, '具体需求': 1.0, '房屋类型': 1.0, '施工位置': 1.0,
        '家具类型': 1.0, '户型': 1.0, '家具/装修风格': 1.0, '材质材料': 1.0, '房子or家具大小/面积/体积': 1.0,
        '是否在线': 1.0, '金额': 1.0, '性别': 1.0, '需求人员': 1.0, '无': 1.0
    },
    "intent_sample_ratio": {
        '问电话': 1.0, '问微信': 1.0, '问机构联系方式': 1.0, '微信电话同号': 1.0, '要求对方加微信': 1.0,
        '拒绝某种联系途径': 1.0, '要求微信沟通': 1.0,
        '要求客服打电话': 1.0, '问回访时间': 1.0, '要求对方联系': 1.0, '智能性质疑': 1.0, '问在线': 1.0,
        '问机构名称': 1.0, '问机构地点': 1.0, '问机构可信度': 1.0, '问费用': 1.0, '问资料': 1.0,
        '求介绍/咨询意见': 1.0, '求加速': 1.0, '问业务范围': 1.0, '问产品/持续时长': 1.0, '问是否能参观': 1.0,
        '问装修材料': 1.0, '问质量': 1.0, '问尺寸': 1.0,
        '问实践方法&专业知识': 1.0, '无': 1.0
    }
}

ind_label_configs = {
    "ind_car_nlu": ind_car_nlu,
    "ind_car_v2_nlu": ind_car_v2_nlu,
    "joint_nlu": joint_nlu,
    "comment_intention": comment_intention,
    'ind_home_nlu':ind_home_nlu,
    "joint_nlu": joint_nlu,
    "ind_car_slot": ind_car_slot,
    "ind_car_intent": ind_car_intent
}


def get_label_config(task_name):
    if task_name not in ind_label_configs:
        return ""
    return ind_label_configs[task_name]
